aws/amazon-freertos/vendors/renesas/rx_mcu_boards/rx_driver_package/v125/r_s12ad_rx/src/targets/rx65n/r_s12ad_rx65n.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No 
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS 
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
* this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2016 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_s12ad_rx65n.c
* Description  : Primary source code for 12-bit A/D Converter driver.
***********************************************************************************************************************/
/**********************************************************************************************************************
* History : DD.MM.YYYY Version Description           
*           01.10.2016 1.00    Initial Release.
*                              Modified the register that was initialized when obtaining the compare match result.
*                              Bug fix for self-diag can set during Single scan mode(double trigger).
*                              adc_enable_s12adi() declaration change that same as prototype declaration.
*                              adc_enable_s12gbadi() declaration change that same as prototype declaration.
*                              adc_enable_s12gcadi() declaration change that same as prototype declaration.
*           03.04.2017 2.30    Delete parameter check by the enum value.
*                              R_ADC_Control function returns ADC_ERR_INVALID_ARG when set to group B, C or PGS bit
*                               except for Group scan mode.
*                              Corresponding to the notice when setting the PGS bit in the ADGSPCR register to 1.
*                              Fixed a bug that can set 10bit resolution and 8bit resolution in addition(16 samples).
*                              Fixed a bug that returned ADC_SUCCESS when interrupt is enable and callback function
*                               is not set.
*                              Fixed a bug that no check inside_window_maskb value.
*                              Fixed a bug that wrong register used for if statement in adc_close function.
*                              Fixed a bug that ADTRG can not set to GroupA.
*                              Fixed a bug that can not get status for WindowA/B composite condition.
*                              Fixed a bug that Compare function can not check duplication channel on CH16 to CH20.
*                              Fixed a bug that Compare function can not check invalid channel on Unit1.
*           03.09.2018 3.00    Added the comment to while statement.
*                              Changed procedure for setting the temperature sensor.
*                              Changed trigger setting of group-A priority control operation.
*           05.04.2019 4.00    Renamed file from r_s12ad_rx65x.c to r_s12ad_rx65n.c
*                              Added support for GNUC and ICCRX.
*           22.11.2019 4.40    Added support for atomic control.
*                              Added error processing to adc_open.
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
/* Includes board and MCU related header files. */
#include <stdio.h>
#include "platform.h"

#if defined (BSP_MCU_RX65_ALL)
#include "r_s12ad_rx_config.h"
#include "r_s12ad_rx_private.h"
#include "r_s12ad_rx_if.h"

/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/
#define ADC_PRV_GET_REGS_PTR(x)         (((x)==0) ? (aregs_t *)&S12AD : (aregs_t *)&S12AD1)

#define ADC_PRV_GET_SST_ARR(x)          (((x)==0) ? gp_sreg0_ptrs : gp_sreg1_ptrs)

#define ADC_PRV_ADC_LOCK(x)             (((x)==0) ? BSP_LOCK_S12AD : BSP_LOCK_S12AD1)
#define ADC_PRV_SST_REG_MAX(x)          (((x)==0) ? ADC_SST_CH7 : ADC_SST_REG_MAX)
#define ADC_PRV_INVALID_CH_MASK(x)      (((x)==0) ? ADC_PRV_INVALID_CH_MASK0 : ADC_PRV_INVALID_CH_MASK1)

#define ADC_PRV_GRPBL1_S12CMPIA0_FLAG    (1<<20)
#define ADC_PRV_GRPBL1_S12CMPIB0_FLAG    (1<<21)
#define ADC_PRV_GRPBL1_S12CMPIA1_FLAG    (1<<22)
#define ADC_PRV_GRPBL1_S12CMPIB1_FLAG    (1<<23)

#define ADC_PRV_INT_S12ADI0    (BSP_PRV_VALID_MAP_INT(B, BSP_MAPPED_INT_CFG_B_VECT_S12ADC0_S12ADI0))
#define ADC_PRV_INT_S12GBADI0  (BSP_PRV_VALID_MAP_INT(B, BSP_MAPPED_INT_CFG_B_VECT_S12ADC0_S12GBADI0))
#define ADC_PRV_INT_S12GCADI0  (BSP_PRV_VALID_MAP_INT(B, BSP_MAPPED_INT_CFG_B_VECT_S12ADC0_S12GCADI0))
#define ADC_PRV_INT_S12ADI1    (BSP_PRV_VALID_MAP_INT(B, BSP_MAPPED_INT_CFG_B_VECT_S12ADC1_S12ADI1))
#define ADC_PRV_INT_S12GBADI1  (BSP_PRV_VALID_MAP_INT(B, BSP_MAPPED_INT_CFG_B_VECT_S12ADC1_S12GBADI1))
#define ADC_PRV_INT_S12GCADI1  (BSP_PRV_VALID_MAP_INT(B, BSP_MAPPED_INT_CFG_B_VECT_S12ADC1_S12GCADI1))

#define ADC_PRV_INT_CHECK_UNIT_0  (ADC_PRV_INT_S12ADI0 && ADC_PRV_INT_S12GBADI0 && ADC_PRV_INT_S12GCADI0)
#define ADC_PRV_INT_CHECK_UNIT_1  (ADC_PRV_INT_S12ADI1 && ADC_PRV_INT_S12GBADI1 && ADC_PRV_INT_S12GCADI1)

