aws/amazon-freertos/vendors/renesas/rx_mcu_boards/rx_driver_package/v125/r_s12ad_rx/src/targets/rx65n/r_s12ad_rx65n.c
/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/
/* Unit1 registers are a superset of Unit0 EXCEPT that they do not contain the S&H registers */
typedef R_BSP_VOLATILE_EVENACCESS struct st_s12ad1  aregs_t;

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
/* In RAM */

adc_ctrl_t g_dcb[2] = {{ADC_MODE_MAX,
                        NULL,
                        false,
                        ADC_PRV_GRPBL1_S12CMPIA0_FLAG,
                        ADC_PRV_GRPBL1_S12CMPIB0_FLAG},

                        {ADC_MODE_MAX,
                        NULL,
                        false,
                        ADC_PRV_GRPBL1_S12CMPIA1_FLAG,
                        ADC_PRV_GRPBL1_S12CMPIB1_FLAG}};

/* In ROM. A/D Data Register pointers */

volatile uint16_t R_BSP_EVENACCESS_SFR * const  gp_dreg0_ptrs[ADC_REG_MAX+1] =
                        {   &S12AD.ADDR0,       /* channel 0 */
                            &S12AD.ADDR1,       /* channel 1 */
                            &S12AD.ADDR2,       /* channel 2 */
                            &S12AD.ADDR3,
                            &S12AD.ADDR4,
                            &S12AD.ADDR5,
                            &S12AD.ADDR6,
                            &S12AD.ADDR7,
                            NULL,
                            NULL,
                            NULL,               /* channel 10 */
                            NULL,
                            NULL,
                            NULL,
                            NULL,
                            NULL,
                            NULL,
                            NULL,
                            NULL,
                            NULL,
                            NULL,               /* channel 20 */
                            NULL,               /* sensor */
                            NULL,
                            &S12AD.ADDBLDR.WORD, /* double trigger register */
                            &S12AD.ADDBLDRA,    /* double trigger registerA */
                            &S12AD.ADDBLDRB,    /* double trigger registerB */
                            &S12AD.ADRD.WORD    /* self-diagnosis register */
                        };

volatile uint16_t R_BSP_EVENACCESS_SFR * const  gp_dreg1_ptrs[ADC_REG_MAX+1] =
                        {   &S12AD1.ADDR0,       /* channel 0 */
                            &S12AD1.ADDR1,       /* channel 1 */
                            &S12AD1.ADDR2,       /* channel 2 */
                            &S12AD1.ADDR3,
                            &S12AD1.ADDR4,
                            &S12AD1.ADDR5,
                            &S12AD1.ADDR6,
                            &S12AD1.ADDR7,
                            &S12AD1.ADDR8,
                            &S12AD1.ADDR9,
                            &S12AD1.ADDR10,
                            &S12AD1.ADDR11,
                            &S12AD1.ADDR12,
                            &S12AD1.ADDR13,
                            &S12AD1.ADDR14,
                            &S12AD1.ADDR15,
                            &S12AD1.ADDR16,
                            &S12AD1.ADDR17,
                            &S12AD1.ADDR18,
                            &S12AD1.ADDR19,
                            &S12AD1.ADDR20,
                            &S12AD1.ADTSDR,    /* temperature sensor */
                            &S12AD1.ADOCDR,    /* voltage sensor */
                            &S12AD1.ADDBLDR,   /* double trigger register */
                            &S12AD1.ADDBLDRA,  /* double trigger registerA */
                            &S12AD1.ADDBLDRB,  /* double trigger registerB */
                            &S12AD1.ADRD.WORD  /* self-diagnosis register */
                        };

/* In ROM. Sample State (SST) Register pointers */

/* 8-bit register pointers */
volatile uint8_t R_BSP_EVENACCESS_SFR * const  gp_sreg0_ptrs[ADC_SST_REG_MAX+1] =
                        {   &S12AD.ADSSTR0,     /* channel 0 */
                            &S12AD.ADSSTR1,     /* channel 1 */
                            &S12AD.ADSSTR2,     /* channel 2 */
                            &S12AD.ADSSTR3,
                            &S12AD.ADSSTR4,
                            &S12AD.ADSSTR5,
                            &S12AD.ADSSTR6,
                            &S12AD.ADSSTR7,
                            NULL,
                            NULL,
                            NULL,
                            NULL,
                            NULL,
                            NULL,
                            NULL,
                            NULL,
                            NULL,
                            NULL,
                            NULL
                        };


volatile uint8_t R_BSP_EVENACCESS_SFR * const  gp_sreg1_ptrs[ADC_SST_REG_MAX+1] =
                        {   &S12AD1.ADSSTR0,     /* channel 0 */
                            &S12AD1.ADSSTR1,     /* channel 1 */
                            &S12AD1.ADSSTR2,     /* channel 2 */
                            &S12AD1.ADSSTR3,
                            &S12AD1.ADSSTR4,
                            &S12AD1.ADSSTR5,
                            &S12AD1.ADSSTR6,
                            &S12AD1.ADSSTR7,
                            &S12AD1.ADSSTR8,
                            &S12AD1.ADSSTR9,
                            &S12AD1.ADSSTR10,
                            &S12AD1.ADSSTR11,
                            &S12AD1.ADSSTR12,
                            &S12AD1.ADSSTR13,
                            &S12AD1.ADSSTR14,
                            &S12AD1.ADSSTR15,
                            &S12AD1.ADSSTRL,     /* channels 16-20 */
                            &S12AD1.ADSSTRT,     /* temperature sensor */
                            &S12AD1.ADSSTRO      /* voltage sensor */
                        };

#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
static adc_err_t adc_check_open_cfg(uint8_t                unit,
                                    adc_mode_t const       mode,
                                    adc_cfg_t * const      p_cfg,
                                    void         (* const  p_callback)(void *p_args));

static adc_err_t adc_check_scan_config(uint8_t const unit,  adc_ch_cfg_t *p_config);
#endif

static adc_err_t adc_configure_scan(uint8_t const unit,  adc_ch_cfg_t *p_config);
static void adc_configure_sensors(adc_ch_cfg_t  *p_config);
static void adc_enable_s12adi(uint8_t unit);
static void adc_enable_s12gbadi(uint8_t unit);
static void adc_enable_s12gcadi(uint8_t unit);
static void adc_s12cmpia0_isr(void *cb_args);
static void adc_s12cmpib0_isr(void *cb_args);
static void adc_s12cmpia1_isr(void *cb_args);
static void adc_s12cmpib1_isr(void *cb_args);
static adc_err_t adc_en_comparator_level0(uint8_t unit, adc_cmpwin_t  *p_cmpwin);
static uint32_t adc_get_and_clr_cmpi_flags(uint8_t unit);
static uint32_t adc_get_and_clr_cmpi_flagsb(uint8_t unit);

#if ADC_PRV_INT_CHECK_UNIT_0
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12adi0_isr, VECT(S12ADC0,S12ADI0))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12gbadi0_isr, VECT(S12ADC0,S12GBADI0))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12gcadi0_isr, VECT(S12ADC0,S12GCADI0))
#endif
#if ADC_PRV_INT_CHECK_UNIT_1
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12adi1_isr, VECT(S12ADC1,S12ADI1))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12gbadi1_isr, VECT(S12ADC1,S12GBADI1))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12gcadi1_isr, VECT(S12ADC1,S12GCADI1))
#endif

