aws/amazon-freertos/vendors/renesas/rx_mcu_boards/rx_driver_package/v125/r_s12ad_rx/src/targets/rx65n/r_s12ad_rx65n.c
        /* A/D-Converted Value Addition/Average Function Select Register 1 initialize */
        S12AD1.ADADS1.WORD = 0;

        /* A/D Conversion Extended Input Control Register initialize */
        S12AD1.ADEXICR.WORD = 0;

        /* A/D Channel Select Register B1 initialize */
        S12AD1.ADANSB1.WORD = 0;

        /* A/D Comparison Function Window A Extended Input Select Register initialize */
        S12AD1.ADCMPANSER.BYTE = 0;

        /* A/D Comparison Function Window A Extended Input Comparison Condition
           Setting Register initialize */
        S12AD1.ADCMPLER.BYTE = 0;

        /* A/D Comparison Function Window A Channel Select Register 1 initialize */
        S12AD1.ADCMPANSR1.WORD = 0;

        /* A/D Comparison Function Window A Comparison Condition Setting Register 1 initialize */
        S12AD1.ADCMPLR1.WORD = 0;

        /* A/D Comparison Function Window A Channel Status Register 1 initialize */
        u16_dummy = S12AD1.ADCMPSR1.WORD;
        S12AD1.ADCMPSR1.WORD = 0;

        /* A/D Comparison Function Window A Extended Input Channel Status Register initialize */
        u8_dummy = S12AD1.ADCMPSER.BYTE;
        S12AD1.ADCMPSER.BYTE = 0;

        /* A/D Channel Select Register C1 initialize */
        S12AD1.ADANSC1.WORD = 0;

        /* A/D Group C Extended Input Control Register */
        S12AD1.ADGCEXCR.BYTE = 0;
        
        /* A/D Sampling State Register initialize */
        S12AD1.ADSSTRL = 0x0B;
        S12AD1.ADSSTRT = 0x0B;
        S12AD1.ADSSTRO = 0x0B;
        S12AD1.ADSSTR8 = 0x0B;
        S12AD1.ADSSTR9 = 0x0B;
        S12AD1.ADSSTR10 = 0x0B;
        S12AD1.ADSSTR11 = 0x0B;
        S12AD1.ADSSTR12 = 0x0B;
        S12AD1.ADSSTR13 = 0x0B;
        S12AD1.ADSSTR14 = 0x0B;
        S12AD1.ADSSTR15 = 0x0B;
        if (0 != S12AD1.ADSSTR15)
        {

            /* Dommy read and compare */
            R_BSP_NOP();
        }
    }

    /* SET TEMPERATURE SENSOR */
    if (1 == unit)
    {
        if (ADC_TEMP_SENSOR_NOT_AD_CONVERTED != p_cfg->temp_sensor)
        {
            if (ADC_TEMP_SENSOR_AD_CONVERTED == p_cfg->temp_sensor)
            {
                S12AD1.ADEXICR.BIT.TSSA = 1;     // select temperature output GroupA
                S12AD1.ADEXICR.BIT.TSSB = 0;
                S12AD1.ADGCEXCR.BIT.TSSC = 0;
            }
            else if (ADC_TEMP_SENSOR_AD_CONVERTED_GROUPB == p_cfg->temp_sensor)
            {
                S12AD1.ADEXICR.BIT.TSSA = 0;
                S12AD1.ADEXICR.BIT.TSSB = 1;     // select temperature output GroupB
                S12AD1.ADGCEXCR.BIT.TSSC = 0;
            }
            else
            {
                S12AD1.ADEXICR.BIT.TSSA = 0;
                S12AD1.ADEXICR.BIT.TSSB = 0;
                S12AD1.ADGCEXCR.BIT.TSSC = 1;    // select temperature output GroupC
            }
        }
    }

    /* SET MODE RELATED REGISTER FIELDS */
    g_dcb[unit].mode = mode;
    if ((ADC_MODE_SS_MULTI_CH_GROUPED == mode)
        || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A == mode))
    {
        p_regs->ADCSR.BIT.ADCS = ADC_ADCS_GROUP_SCAN;
    }
    else if ((ADC_MODE_SS_MULTI_CH_GROUPED_GROUPC == mode)
    || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A_GROUPC == mode))
    {
        p_regs->ADCSR.BIT.ADCS = ADC_ADCS_GROUP_SCAN;
        p_regs->ADGCTRGR.BIT.GRCE = 1;       // Use Group C
    }
    else
    {
        if ((ADC_MODE_CONT_ONE_CH == mode) || (ADC_MODE_CONT_MULTI_CH == mode))
        {
            p_regs->ADCSR.BIT.ADCS = ADC_ADCS_CONT_SCAN;
        }

        /* other modes have ADCS=0 */
    }

    if ((ADC_MODE_SS_ONE_CH_DBLTRIG == mode)
    || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A == mode)
    || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A_GROUPC == mode))
    {
        p_regs->ADCSR.BIT.DBLE = 1;         // enable double trigger
    }

    /* SET TRIGGER AND INTERRUPT PRIORITY REGISTER FIELDS */
    if (ADC_TRIG_SOFTWARE != p_cfg->trigger)
    {
        p_regs->ADSTRGR.BIT.TRSA = p_cfg->trigger;
    }

    if (ADC_TRIG_ASYNC_ADTRG == p_cfg->trigger)
    {
        p_regs->ADCSR.BIT.EXTRG = 1;        // set ext trigger for async trigger
    }

    if (ADC_ADCS_GROUP_SCAN == p_regs->ADCSR.BIT.ADCS)
    {
        p_regs->ADSTRGR.BIT.TRSB = p_cfg->trigger_groupb;
        p_regs->ADGCTRGR.BIT.TRSC = p_cfg->trigger_groupc;      // for Group C
        if (0 == unit)
        {
#if ADC_PRV_INT_CHECK_UNIT_0
            IPR(S12ADC0,S12GBADI0) = p_cfg->priority_groupb;
            IPR(S12ADC0,S12GCADI0) = p_cfg->priority_groupc;    // for Group C
#endif
        }
        else
        {
#if ADC_PRV_INT_CHECK_UNIT_1
            IPR(S12ADC1,S12GBADI1) = p_cfg->priority_groupb;
            IPR(S12ADC1,S12GCADI1) = p_cfg->priority_groupc;    // for Group C
#endif
        }

    }

    if (0 == unit)
    {
#if ADC_PRV_INT_CHECK_UNIT_0
        IPR(S12ADC0,S12ADI0) = p_cfg->priority;
#endif
    }
    else
    {
#if ADC_PRV_INT_CHECK_UNIT_1
        IPR(S12ADC1,S12ADI1) = p_cfg->priority;
#endif
    }

    /* SET REGISTER FIELDS FOR REMAINING PARAMETERS */
    p_regs->ADCER.BIT.ADPRC = p_cfg->resolution;      // must all be separate
    p_regs->ADCER.BIT.ADRFMT = (ADC_ALIGN_LEFT == p_cfg->alignment) ? 1 : 0;
    p_regs->ADCER.BIT.ACE = (ADC_CLEAR_AFTER_READ_ON == p_cfg->clearing) ? 1 : 0;
    if (1 == unit)
    {
        if (ADC_TEMP_SENSOR_NOT_AD_CONVERTED != p_cfg->temp_sensor)
        {
            S12AD1.ADEXICR.BIT.TSSAD = (ADC_TEMP_SENSOR_ADD_ON == p_cfg->add_temp_sensor) ? 1 : 0;
        }
    }
    p_regs->ADADC.BYTE = p_cfg->add_cnt;

    /* SAVE CALLBACK FUNCTION POINTER */
    g_dcb[unit].p_callback = p_callback;

    /* MARK DRIVER AS OPENED */
    g_dcb[unit].opened = true;
    R_BSP_HardwareUnlock(ADC_PRV_ADC_LOCK(unit));

    return ADC_SUCCESS;
} /* End of function adc_open() */


/******************************************************************************
* Function Name: adc_check_open_cfg
* Description  : If Parameter Checking is enabled, this function will simply
*                validate the parameters passed to the adc_open function.
** Arguments    : unit -
*                    0 or 1
*                mode -
*                    Operational mode (see enumeration below)
*                p_cfg-
*                    Pointer to configuration structure (see below)
*                p_callback-
*                    Optional pointer to function called from interrupt when
*                    a scan completes
* Return Value : ADC_SUCCESS-
*                    Successful
*                ADC_ERR_INVALID_ARG-
*                    mode or element of p_cfg structure has invalid value.
*                ADC_ERR_ILLEGAL_ARG-
*                    an argument is illegal based upon mode
*******************************************************************************/
#if (ADC_CFG_PARAM_CHECKING_ENABLE == 1)
static adc_err_t adc_check_open_cfg(uint8_t                unit,
                                    adc_mode_t const       mode,
                                    adc_cfg_t * const      p_cfg,
                                    void         (* const  p_callback)(void *p_args))
{

