aws/amazon-freertos/vendors/renesas/rx_mcu_boards/rx_driver_package/v125/r_s12ad_rx/src/targets/rx65n/r_s12ad_rx65n.c
        /* Cast from uint8_t to uint32_t */
        group_priority.ipl = (uint32_t)(p_cmpwin->int_priority);

        if (true == p_cmpwin->windowa_enable) // COMPARATOR A
        {
            R_BSP_InterruptWrite(BSP_INT_SRC_BL1_S12AD0_S12CMPAI, adc_s12cmpia0_isr);
            R_BSP_InterruptWrite(BSP_INT_SRC_BL1_S12AD1_S12CMPAI1, adc_s12cmpia1_isr);
            p_regs->ADCMPCR.BIT.CMPAIE = 1;             // enable interrupt in ADC
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif /* #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
            ICU.GENBL1.LONG |= g_dcb[unit].cmpi_mask;   // enable group subvector
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif /* #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
            if (0 == unit)
            {
                R_BSP_InterruptControl(BSP_INT_SRC_BL1_S12AD0_S12CMPAI,

                                        /* Cast to match the argument type */
                                        BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, (void *) &group_priority);
            }
            else
            {
                R_BSP_InterruptControl(BSP_INT_SRC_BL1_S12AD1_S12CMPAI1,

                                        /* Cast to match the argument type */
                                        BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, (void *) &group_priority);
            }
        }

        if (true == p_cmpwin->windowb_enable) // COMPARATOR B
        {
            R_BSP_InterruptWrite(BSP_INT_SRC_BL1_S12AD0_S12CMPBI, adc_s12cmpib0_isr);
            R_BSP_InterruptWrite(BSP_INT_SRC_BL1_S12AD1_S12CMPBI1, adc_s12cmpib1_isr);
            p_regs->ADCMPCR.BIT.CMPBIE = 1;             // enable interrupt in ADC
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif /* #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
            ICU.GENBL1.LONG |= g_dcb[unit].cmpi_maskb;   // enable group subvector
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif /* #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
            if (0 == unit)
            {
                R_BSP_InterruptControl(BSP_INT_SRC_BL1_S12AD0_S12CMPBI,

                                        /* Cast to match the argument type */
                                        BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, (void *) &group_priority);
            }
            else
            {
                R_BSP_InterruptControl(BSP_INT_SRC_BL1_S12AD1_S12CMPBI1,

                                        /* Cast to match the argument type */
                                        BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, (void *) &group_priority);
            }
        }
    }

    /* Do NOT enable GENBL1, CMPIAE or CMPIBE here with the intention of polling the GRPBL1 bit
     * for condition met. Another driver may make the GROUPBL1 priority non-zero
     * and there will be no subvector interrupt/callback here to clear the ICU flag.
     * The result will be that the BSP will be in an "infinite loop" processing the
     * group interrupt because the flag never resets, and the app level will not run.
     */

    return ADC_SUCCESS;
} /* End of function adc_en_comparator_level0() */


/*****************************************************************************
* Function Name: adc_get_and_clr_cmpi_flags
* Description  : Returns flags for all channels/sensors that met comparator
*                condition and clears the flags for next interrupt.
* Arguments    : unit -
*                   0 or 1
* Return Value : channels/sensors that met comparator condition
******************************************************************************/
static uint32_t adc_get_and_clr_cmpi_flags(uint8_t unit)
{
    uint32_t    flags;

    /* NOTE: S12CMPAI interrupts are level-based, not edge, so there will be
     * continuous triggers while condition is met. Writing 0 to the flags has
     * no effect UNTIL the condition clears.
     *
     * Also, the data register for the channel/sensor will still be written to.
     * The S12CMPAI interrupt does not replace it but is in addition to it.
     */

    if (0 == unit)
    {

        /* Cast and return value */
        flags = (uint32_t)S12AD.ADCMPSR0.WORD;
        S12AD.ADCMPSR0.WORD = 0;

        if(0 == S12AD.ADCMPSR0.WORD)
        {
            R_BSP_NOP();
        }
    }
    else
    {

        /* Cast and return value */
        flags = (uint32_t)S12AD1.ADCMPSR0.WORD;
        S12AD1.ADCMPSR0.WORD = 0;

        if(0 == S12AD1.ADCMPSR0.WORD)
        {
            R_BSP_NOP();
        }

        /* Cast and return value */
        flags |= (((uint32_t)S12AD1.ADCMPSR1.WORD) << 16);
        S12AD1.ADCMPSR1.WORD = 0;

        if(0 == S12AD1.ADCMPSR1.WORD)
        {
            R_BSP_NOP();
        }

        flags |= ((1 == S12AD1.ADCMPSER.BIT.CMPFTS) ? ADC_MASK_TEMP : 0);
        flags |= ((1 == S12AD1.ADCMPSER.BIT.CMPFOC) ? ADC_MASK_VOLT : 0);
        S12AD1.ADCMPSER.BYTE = 0;

        if(0 == S12AD1.ADCMPSER.BYTE)
        {
            R_BSP_NOP();
        }
    }

    return flags;
} /* End of function adc_get_and_clr_cmpi_flags() */


/*****************************************************************************
* Function Name: adc_get_and_clr_cmpi_flagsb
* Description  : Returns flags for all channels/sensors that met comparator
*                condition and clears the flags for next interrupt.
* Arguments    : unit -
*                   0 or 1
* Return Value : channels/sensors that met comparator condition
******************************************************************************/
static uint32_t adc_get_and_clr_cmpi_flagsb(uint8_t unit)
{
    uint32_t    flags;

